<template>
  <div class="wrapper">
    <div class="contain">
      <TypographyTitle style="text-align: center"> 嗨行旅游B2B平台用户服务协议 </TypographyTitle>
      <TypographyTitle :heading="6"> 发布日期：2024年12月11日 </TypographyTitle>
      <TypographyTitle :heading="6"> 生效日期：2024年12月28日 </TypographyTitle>
      <TypographyTitle :heading="4"> 提示条款 </TypographyTitle>
      <TypographyParagraph>
        【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。
        <TypographyText style="font-weight: bold"> 请您务必 审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。重点条款将以粗体标识，您应仔细阅读。 </TypographyText>
        如您对协议有任何疑问，可通过本协议中提供的联系方式咨询。当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序 后，即表示您已充分阅读、理解并接受本协议的全部内容，成为八爪鱼
        B2B平台的用户。<TypographyText style="font-weight: bold">阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</TypographyText>
      </TypographyParagraph>
      <TypographyParagraph>
        【服务协议的确认和接纳】 嗨行旅游B2B 平台提醒您：嗨行旅游 B2B 平台厦门嗨行旅游服务有限公司运营，涉及具体产品服务的，将由有资质的服务商提供。嗨行旅游 B2B 平台仅面向具有旅游业务经营许可的
        企业用户开放注册。如果用户（以下或称“您”）访问嗨行旅游 B2B 平台，预订或使用嗨行旅游 B2B 平台的产品或服务，便视为您接受了《嗨行旅游B2B平台用户服务协议》（以下简称
        “本协议”）。请您仔细阅读以下内容，尤其是以下加粗字体。如果您不同意以下任何内容，请立 刻停止访问/使用本网站或其他任何移动应用或软件所提供的相关服务。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 1、总则 </TypographyTitle>
      <TypographyParagraph>
        本协议内容包括协议正文、嗨行旅游B2B平台已经发布的或将来可能发布的各类规则，包括但不限于免责声明、个人信息保护政策、 个人信息授权声明、预订条款/预订须知、旅游合同、账户注销协议等其他协议（以下简称
        “其他条款”）。如果本协议与“其他条款”有不一致之处，则以“其他条款”为准。除另 行明确声明的情形之外，任何嗨行旅游B2B 平台提供的产品/服务均受本协议约束。本协议中，“用户”使用嗨行旅游B2B
        平台所提供的产品/服务的自然人和法人，包括但不限 于注册用户及未注册用户。凡未注册嗨行旅游B2B 平台的产品/服务的用户，自开始使用嗨行旅游B2B平台的产品及/或服务时即成为我们的“非注册用户”，在使用过程中须遵循本协
        议中除注册用户专属约定以外的其他所有条款。 若您作为嗨行旅游或合作公司的用户访问嗨行旅游B2B 平台或使用嗨行旅游B2B平台的产品/服务，即视为
        您同意本协议的所有条款及嗨行旅游B2B平台公布的其他条款、规则、说明和操作指引。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 2、服务须知 </TypographyTitle>
      <TypographyParagraph> （1）自行配置必要的上网设备，包括 PC、手机、平板电脑，以及路由器等。 </TypographyParagraph>
      <TypographyParagraph>
        （2）个人上网和支付与此服务有关的网络费用、电话费用。 若选择移动设备，您须选择并安装与所上网设备相匹配的客户端版本，包括但不限于 iOS、Android。考虑嗨行旅游B2B 平台提供的产品/服务的重要性，您同意：
      </TypographyParagraph>
      <TypographyParagraph> （1）提供真实、详尽及准确的个人资料用于注册嗨行旅游B2B 平台账户，不得使用他人公 司、邮箱、手机号码或以其他冒用他人身份的方式进行账号注册。 </TypographyParagraph>
      <TypographyParagraph>
        （2）在提交注册信息后，如果信息发生变化，您应及时更改。如果您提供的信息不符合 合法、真实、准确、详尽的要求，您需承担因此引起的相应责任及后果，并且嗨行旅游B2B 平台保留终止您使用各项产品/服务的权利。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 3、服务协议的修改 </TypographyTitle>
      <TypographyParagraph>
        嗨行旅游B2B平台会在必要时修改本协议及/或各类规则，并将在嗨行旅游B2B 平台相应页面 提前公告。具体而言，嗨行旅游将通过适当的方式在平台上对本协议的修改事宜进行公告或通知，此类通知于公布或发送之日即视为已送达您。
        嗨行旅游承诺，对于本协议及/或各类规则的修改，嗨行旅游B2B
        平台应当于变更后的文本生效之日前至少七日进行公告或通知。如您不同意相关变更，应当立即停止访问嗨行旅游B2B平台或使用嗨行旅游B2B平台的产品/服务。若您在本协议及/或各类规则变更生效之日后继续使用嗨行旅游B2B
        平台的产品/服务的，即表示您接受修订后的文本。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 4、服务变更、中断、终止 </TypographyTitle>
      <TypographyParagraph>
        您完全理解并同意，本服务涉及到互联网及移动通讯等服务，可能会受到各个环节不稳定 因素的影响。因此任何因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、GSM
        网络、互联网络、通信线路等其他嗨行旅游B2B平台无法预测或控制的原因，造成服务中断、取消或终止的风险，由此给您带来的损失，嗨行旅游不承担赔偿责任。嗨行旅游B2B平台需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维
        护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，嗨行旅游无需为此承担任何责任，但嗨行旅游B2B平台应尽可能事先进行通知。
        您完全理解并同意，除本服务协议另有规定外，鉴于网络服务的特殊性，嗨行旅游B2B平台
        有可能变更、中断或终止部分或全部的网络服务。除了您已经通过嗨行旅游B2B平台订购或申请的产品/服务并已完成支付并已获得确认订购或申请的情况之外，嗨行旅游无需为变更、
        中断或终止服务承担任何责任，但嗨行旅游应尽可能事先进行通知，并尽可能给您预留时间 以便处理相关权益。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 5、用户行为规范 </TypographyTitle>
      <TypographyParagraph>
        (1) 您在使用嗨行旅游B2B 平台产品/服务时，必须遵守中华人民共和国相关 法律法规的规定， 您承诺将不会利用嗨行旅游 B2B 平台的产品/服务进行任何 违法或不正当的活动，包括但不 限于下列行为:
      </TypographyParagraph>
      <TypographyParagraph>
        <ul>
          <li>上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：</li>
          <li>反对宪法所确定的基本原则的；</li>
          <li>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</li>
          <li>损害国家荣誉和利益的； l 煽动民族仇恨、民族歧视、破坏民族团结的；</li>
          <li>破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
          <li>散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
          <li>散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
          <li>侮辱或者诽谤他人，侵害他人合法权利的；</li>
          <li>含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德 上令人反感的内容；</li>
          <li>含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。</li>
        </ul>
      </TypographyParagraph>
      <TypographyParagraph>（2）为任何非法目的而访问嗨行旅游B2B平台或使用嗨行旅游产品/服务，或未经允许，利用嗨行旅游B2B平台从事以下活动： </TypographyParagraph>
      <TypographyParagraph>
        <ul>
          <li>未经允许，进入计算机信息网络或者非法获取、使用计算机信息网络资源的；</li>
          <li>未经允许，对计算机信息网络功能进行删除、修改或者增加的；</li>
          <li>未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、 修改或者增加的；</li>
          <li>故意制作、传播计算机病毒等破坏性程序的；其他危害计算机信息网络安全的行为；</li>
          <li>未经允许，将嗨行旅游B2B平台上的任何数据作商业性利用，包括但不限于在未经嗨行旅游事先书面同意的情况下，以网络爬虫、复制、传播等任何方式获取、使用嗨行旅游B2B平台上展示的资料；</li>
          <li>使用任何装置、软件或例行程序等其他方式干预或试图干预嗨行旅游B2B平台的正常运作 或正在嗨行旅游B2B平台上进行的任何交易、活动，或采取任何将导致不合理的庞大数据负载加诸嗨行旅游B2B平台网络设备的行动；</li>
          <li>违反诚实信用原则的不正当竞争行为，或恶意下订单或虚假交易等其他恶意扰乱嗨行旅游B2B平台产品/服务交易秩序的行为；</li>
          <li>
            与网上交易无关的其他行为，例如发布广告信息（得到嗨行旅游书面许可的除外）； 发布任何侵犯嗨行旅游B2B平台或他人合法权益、违反法律法规及其他规范性文件（包括
            但不限于《互联网视听节目服务管理规定》、《网络信息内容生态治理规定》等）及本协议 的内容。
          </li>
        </ul>
      </TypographyParagraph>
      <TypographyParagraph>
        上述行为的发生，将视为您对本协议的根本违约。在任何情况下，嗨行旅游B2B平台一旦合理地认为您存在或可能存在上述行为的，可以在任何时候，不经事先通知删除您散布或传播的任何信息，并中止或终止向您提供嗨行旅游B2B平台的产品/服务。您需对自己在访问嗨行旅游B2B平台或使用嗨行旅游B2B平台的产品/服务中的行为承担法律责任。您若在嗨行旅游B2B平台散布或传播以上违反国家法律法规或公序良俗的信息，嗨行旅游B2B平台的系统记录将有可能作为您违法犯罪的证据向有关部门提供。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 6、知识产权</TypographyTitle>
      <TypographyParagraph>
        嗨行旅游在嗨行旅游B2B平台提供的相关产品/服务中使用或产生的内容（包括但不限于产
        品、软件、网页、文字、图片、音频、视频、数据、信息等）的知识产权归嗨行旅游所有。嗨行旅游所有和享有的知识产权，不因您的任何使用行为而发生权利转移。未经嗨行旅游事先书面明确同意，您不得以任何形式对前述内容进行使用或创造相关衍生作品，但如您是作品的权利人、您已获得相关权利人授权或嗨行旅游与您另有约定的除外。
        您承诺，通过嗨行旅游B2B平台发布上传的内容（包括但不限于文字、图片、视频、音频等 各种形式的内容）为原创或已获合法授权，上传内容的知识产权归属于您本人或者相关权
        利人所有。您通过嗨行旅游B2B平台上传发布的内容，由您自行承担责任。如您发送或传播
        的内容违法违规或侵犯他人权利的，嗨行旅游有权进行独立判断并采取删除、屏蔽或断开链接等措施。因侵犯他人知识产权而引发纠纷的，您须自行承担全部责任。如您的行为给嗨行旅游造成损失的，嗨行旅游有权按照法律规定要求您赔偿。
        厦门嗨行旅游服务有限公司是嗨行旅游B2B平台的运营商,拥有此网站内容及资源的版权,
        受国家知识产权保护,享有对本网站声明的解释与修改权；未经厦门嗨行旅游服务有限公司的明确书面许可或与嗨行旅游B2B平台另有书面约定的，任何一方不得更改、演绎、拆
        分、反解对方的技术和程序或以其它任何方式进行可能损害对方专有权利的行为。未经授权，您不得擅自使用、复制嗨行旅游的商标、标志、商业信息、技术及其他资料。嗨行旅游B2B平台网站页面所有信息受《中华人民共和国著作权法》及相关法律法规和中国
        加入的所有知识产权方面的国际条约的保护。嗨行旅游制定了旨在保护知识产权权利人合法 权益的相关措施和步骤，<TypographyText style="font-weight: bold">
          当著作权人和/或依法可以行使信息网络传播权的权利人（以下简 称“权利人”）发现可能存有侵犯其信息网络传播权的情况，权利人应事先向本站发出书面
          权利通知，并提供有效权属证明，本站将根据相关法律规定采取措施删除相关内容。 </TypographyText
        >嗨行旅游B2B平台不保证为向用户提供便利而设置的外部链接的准确性和完整性，若由此而引起的版权问题或其他问题，请致电或电邮本网站。经核实后会立即予以删除或更改。嗨行旅游B2B平台保留删除站内各类不符合规定的信息而不通知会员的权利。
      </TypographyParagraph>
      <TypographyParagraph>
        <TypographyText style="font-weight: bold">
          嗨行旅游B2B平台在本服务中所使用的“嗨行旅游”、“嗨行旅游B2B平台”及卡通形象等，商业标识及特有的装饰装潢，其著作权或商标权等相应权利归嗨行旅游B2B平台所有。上述及其他任何本服务包含的内容的知识产权均受到法律法规保护，未经嗨行旅游B2B平台、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
        </TypographyText>
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 7、平台隐私政策</TypographyTitle>
      <TypographyParagraph>
        嗨行旅游B2B平台非常重视用户隐私政策并严格遵守相关的法律规定。请您仔细阅读
        <TypographyText style="font-weight: bold"> 《平台隐私政策》 </TypographyText
        >后再继续使用。如果您继续使用我们的服务，表示您已经充分阅读和理解我们协议的全部内容。本平台尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更优质的服
        务，本平台会按照本隐私权政策的规定使用和披露您的个人信息。除本隐私权政策另有规 定外，在未征得您事先许可的情况下，本平台不会将这些信息对外披露或向第三方提供。 本平台会不时更新本隐私权政策。
        您在同意本应用服务使用协议之时，即视为您已经同意 本隐私权政策全部内容。
      </TypographyParagraph>
      <TypographyParagraph> （1）适用范围 </TypographyParagraph>
      <TypographyParagraph> (a)在您注册本平台帐号时，您根据平台要求提供的个人注册信息； </TypographyParagraph>
      <TypographyParagraph>
        (b)在您使用平台网络服务，或访问平台网页时，本平台自动接收并记录的您的浏览器和 计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时 间、软硬件特征信息及您需求的网页记录等数据；
      </TypographyParagraph>
      <TypographyParagraph> (c)本平台通过合法途径从商业伙伴处取得的用户个人数据。 </TypographyParagraph>
      <TypographyParagraph>(d)本平台严禁用户发布不良信息，如裸露、色情和亵渎内容，发布的内容我们会进行审核，一经发现不良信息，会禁用该用户的所有权限，予以封号处理。 </TypographyParagraph>
      <TypographyParagraph>（2）信息使用</TypographyParagraph>
      <TypographyParagraph>(a)本平台不会向任何无关第三方提供、出售、出租、分享或交易您的个人登录信息。如果 我们存储发生维修或升级，我们会事先发出推送消息来通知您，请您提前允许本平台消息 通知。</TypographyParagraph>
      <TypographyParagraph>(b)本平台亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本平台用户如从事上述活动，一经发现，本平台有权立即终止与该用户的服务协议。</TypographyParagraph>
      <TypographyParagraph>
        (c)为服务用户的目的，本平台可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本平台合作伙伴共享信息以便他们向您发 送有关其产品和服务的信息（后者需要您的事先同意）。
      </TypographyParagraph>
      <TypographyParagraph> （3）信息披露 </TypographyParagraph>
      <TypographyParagraph> 在如下情况下，本平台将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息： </TypographyParagraph>
      <TypographyParagraph>(a)未经您事先同意，我们不会向第三方披露； </TypographyParagraph>
      <TypographyParagraph>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息； </TypographyParagraph>
      <TypographyParagraph>
        <TypographyText style="font-weight: bold"> (c)根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露； </TypographyText>
      </TypographyParagraph>
      <TypographyParagraph>(d)如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</TypographyParagraph>
      <TypographyParagraph>(e)如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷； </TypographyParagraph>
      <TypographyParagraph>（4）信息存储和交换 </TypographyParagraph>
      <TypographyParagraph>
        本平台收集的有关您的信息和资料将保存在本平台及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本平台收集信息和资料所在地的境外并在境外 被访问、存储和展示。
      </TypographyParagraph>
      <TypographyParagraph>（5）Cookie 的使用 </TypographyParagraph>
      <TypographyParagraph>
        (a)在您未拒绝接受cookies的情况下，本平台会在您的计算机上设定或取用 cookies，以便您能登录或使用依赖于cookies 的本平台服务或功能。本平台使用cookies可为您提供更加周到的个性化服务，包括推广服务。
      </TypographyParagraph>
      <TypographyParagraph>
        (b)您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的 本应用网络服务或功能。
      </TypographyParagraph>
      <TypographyParagraph>(c)通过本应用所设cookies所取得的有关信息，将适用本政策。 </TypographyParagraph>
      <TypographyParagraph>（6）本隐私政策的更改</TypographyParagraph>
      <TypographyParagraph>
        (a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发 布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。
      </TypographyParagraph>
      <TypographyParagraph>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公 司会通过网站通知的形式告知。 </TypographyParagraph>
      <TypographyParagraph>感谢您花时间了解我们的隐私政策！我们将尽全力保护您的个人信息和合法权益，再次感 谢您的信任！ </TypographyParagraph>
      <TypographyTitle :heading="4"> 8、账户安全</TypographyTitle>
      <TypographyParagraph>
        根据页面提示注册提交后，工作人员将对您的信息进行人工审核。审核通过后，您将得到一个嗨行旅游B2B平台账户，并可根据密码规则自行设置账户密码（包括但不限于主账
        号、子账号等）。鉴于网络服务的特殊性，嗨行旅游无义务审核是否是您本人使用账户的用户
        名及密码。任何人只要输入的用户名及密码与数据库中保存的一致，即可凭借该组用户名及密码登录嗨行旅游B2B平台账户，并使用嗨行旅游产品/服务。因此，请您对密码加以妥善保管，切勿将密码告知他人。如果您未能妥善保管密码，您将承担因此而导致或可能导致的全部责任。除嗨行旅游存在过错外，您应对您账户项下的所有行为结果负责。您理解并同意，为使您更好地使用嗨行旅游B2B平台的各项服务，保障您的账户安全，嗨行旅游可要求您按嗨行旅游B2B平台规则以及相关法律法规规定完成实名认证。
        另外，考虑到提供客户服务的便捷性，您确认并同意，您对通过您的账户所进行的活动、行为和事件依法享有权利和承担责任。您不得以任何形式转让账户、授权他人使用您的账户以及与他人交易账户。如果您发现有人未经您的授权使用了您的嗨行旅游B2B平台账户，或您的账户存在其他异常情况导致无法正常登录使用，您需要按照嗨行旅游B2B平台提供的修改密码流程进行密码重置。在此过程中，嗨行旅游可能会要求您提供相应信息及/或证明资料，请确保您所提供的内容真实有效，否则将可能无法通过我们的验证而导致找回失败。您若发现任何非法使用用户账户或安全漏洞的情况，请立即根据本协议提供的联系方式通知嗨行旅游。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 9、法律责任</TypographyTitle>
      <TypographyParagraph>
        嗨行旅游明确表示不提供任何类型的担保，不论是明确的或隐含的，但是不对商业性的隐含担保，特定目的和不违反规定的适当担保作限制。
        对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，嗨行旅游并不承担相应的违约责任：
      </TypographyParagraph>
      <TypographyParagraph>
        <ul>
          <li>因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；</li>
          <li>因电力供应故障、通讯网络故障等公共服务因素或第三方因素；</li>
          <li>在八爪鱼已尽善意管理责任的情形下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。</li>
        </ul>
      </TypographyParagraph>
      <TypographyParagraph>
        嗨行旅游不对任何来自用户不正当使用网络会员服务，非法使用服务或用户向嗨行旅游B2B平台提供的信息有所变动造成的损害承担任何后果，因为嗨行旅游早已提出这些损害的可能性并要求用户加以防范。若您在嗨行旅游B2B平台上实施了违反本协议或其他单项服务协议、规则的行为，嗨行旅游B2B平台可依据相应规则对您的账户执行中止提供部分或全部服务等处理措施。如您的行为构成根本违约的，嗨行旅游B2B平台可冻结您的账户，终止提供服务。如您的行为使嗨行旅游遭受损失（包括直接经济损失和间接经济损失），或受到任何第三方的索赔，或受到有关行政部门的处罚，您应当承担全部的赔偿责任。若有任何人声称您的行为损害第三方权益，并导致嗨行旅游或向嗨行旅游B2B平台提供产品/服务的第三方遭受诉讼或其他纠纷的，您同意为嗨行旅游及/或上述第三方提供抗辩，且嗨行旅游保留自费进行独自抗辩和向您追索的权利。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 10、结束服务</TypographyTitle>
      <TypographyParagraph>
        用户若反对任何服务条款的建议或对后来的条款修改有异议，或对嗨行旅游B2B平台服务不满，可随时中止网站服务。厦门嗨行旅游服务有限公司有权根据实际情况中止网站服务，并将尽最大努力提前予以公示或通知。用户选择停止接受嗨行旅游B2B平台的服务的，可以选择注销帐号，嗨行旅游B2B平台将为用户注销帐号提供便利，但在满足帐号注销的条件前（以具体帐号注销要求为准），嗨行旅游B2B平台有权拒绝用户的帐号
        注销申请而无需承担任何责任。用户帐号注销后，除法律法规规定的信息以及其他嗨行旅游B2B平台认为有必要继续保留的信息（如记录等），原则上嗨行旅游B2B平台将不再保留用户信息。嗨行旅游B2B平台依据法律法规规定或认为确有必要而保留的，保留期限为交
        易完成之日起三年。账号注销后，视为对前述权益的主动放弃。
      </TypographyParagraph>
      <TypographyTitle :heading="4"> 11、法律</TypographyTitle>
      <TypographyParagraph> 本服务条款及我们提供的服务受中国法律管辖并据其解释。任何与本条款与条件及我们的服务有关的争议应提交至厦门嗨行旅游服务有限公司所在地具有管辖权的人民法院管辖。 </TypographyParagraph>
      <TypographyParagraph>若本服务条款的任何项失效、不可执行或失去约束力，您仍须遵守本条款与条件的其他条款的规定，或至少应同意接受与失效、不可执行或失去约束力的条款具有相似规范目的的新条款。 </TypographyParagraph>
    </div>
  </div>
</template>

<script setup lang="ts">
import { TypographyTitle, TypographyParagraph, TypographyText } from '@arco-design/web-vue'
</script>
<style scoped lang="less">
.wrapper {
  height: 100vh;
  overflow-y: auto;
  background-color: #f5f5f5;
  .contain {
    width: 1200px;
    margin: auto;
    background-color: #fff;
    padding: 1px 20px 20px;
  }
}
</style>
